In [1]:
import pandas as pd

df = pd.read_csv("../../data/crew.csv", index_col=0, sep=",")
df.head(df.shape[0])

     white_spots  black_spots      ears
id
0              7            6    indigo
1             15           19      pink
2             11           12     white
3              8            7  piercing
4              7           10     black
..           ...          ...       ...
495           17            1     white
496            7            8       NaN
497           13            7       NaN
498            4            3  piercing
499            4           10      neon

[500 rows x 3 columns]

In [2]:
df.sample(5)

     white_spots  black_spots        ears
id
112           15            2  chartreuse
493           13           19       white
183            1           17         NaN
158            3           11   peachpuff
494            1            4        blue

In [75]:
# Helper to match all officers
def match_officer(pot): 
    resp = pot[(pot["white_spots"] > 12) & (pot["ears"] != "blue")]
    if resp.shape[0] > 1:
        return resp[resp["black_spots"] == 9]
    return resp

In [25]:
# Helmspanda
df.loc[247]

white_spots      17
black_spots       6
ears           neon
Name: 247, dtype: object

In [44]:
# DS Officer
df[(df["white_spots"] > 18) & (df["ears"] == "indigo")]

     white_spots  black_spots    ears
id
251           19            6  indigo

In [49]:
# Paw Plant
pot = df.loc[100:199]
paw_plant = match_officer(pot)
print(paw_plant)

     white_spots  black_spots        ears
id
186           16            9  chartreuse

In [77]:
# Bamboo Chef
paw_plant_white_spots = paw_plant["white_spots"].values[0]
pot = df[(df["ears"] == "chartreuse") & (df["white_spots"] < paw_plant_white_spots)]
match_officer(pot)

     white_spots  black_spots        ears
id
255           13            9  chartreuse

In [79]:
# Pandalorian
pot = df[df["ears"].isna()]
match_officer(pot)

     white_spots  black_spots ears
id
10             3           18  NaN
19            10            6  NaN
48             4            4  NaN
51            10            5  NaN
91             8            3  NaN
101            1            1  NaN
102            3           19  NaN
133           12            2  NaN
138            1            6  NaN
154           17           13  NaN
183            1           17  NaN
196            7            3  NaN
218           16           10  NaN
242           14            9  NaN
261            1            6  NaN
275           17           13  NaN
289           10           11  NaN
292            8           11  NaN
295           11            6  NaN
305            1            1  NaN
306            8            5  NaN
312           15            6  NaN
314            2           17  NaN
329            6            9  NaN
347            2            6  NaN
356           12            8  NaN
365            5           19  NaN
369            7           15  NaN
391            1           15  NaN
402           12           11  NaN
404           12            8  NaN
416            7           15  NaN
441           17           19  NaN
444           19           15  NaN
448            9            9  NaN
449           19            3  NaN
458            3           12  NaN
459           12           19  NaN
470           11           17  NaN
472           15           17  NaN
483           10           18  NaN
496            7            8  NaN
497           13            7  NaN